Revit 2024 API
AssemblyMemberDifferentGeometry Class
 The two assembly members being compared have different geometry
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public class AssemblyMemberDifferentGeometry : AssemblyMemberDifference
Visual Basic
Public Class AssemblyMemberDifferentGeometry _
	Inherits AssemblyMemberDifference
Visual C++
public ref class AssemblyMemberDifferentGeometry : public AssemblyMemberDifference
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.AssemblyMemberDifference
 Autodesk.Revit.DB.AssemblyMemberDifferentGeometry
See Also
AssemblyMemberDifferentGeometry Members
Autodesk.Revit.DB Namespace